gdgly/NUC97X_JS/STM32F4xx/Terminal698/Terminal_ReadMeter_3762_CHINT.c


//ÕıÌ©ÔØ²¨Ä£¿é
#include "AllHead.h"
#include "Terminal_ReadMeter_3762_CHINT.h"
#include "Terminal_ReadMeter_3762.h"

#include "Terminal_Uart_3762_RxTx.h"
#include "../LPC177x8x/lpc177x8x_UART.h"
#include "../LPC177x8x/lpc177x8x_IO.h"
#include "../Calculate/Calculate.h"
#include "../Driver/MEMRW.h"
#include "../Display/Warning.h"

#include "Terminal_AFN0C_RealTimeData_Fn.h"
#include "Terminal_AFN0D_CongealData_Fn.h"
#include "Terminal_AFN0D_SourceData_Fn.h"
#include "Terminal_ReadMeter_SaveFnData.h"
#include "Terminal_ReadMeter_DL645_1997_FnData.h"
#include "Terminal_ReadMeter_DL645_2007_FnData.h"



#if (Project/100)==2//·½°¸0=ÖÇÄÜ±í,100=ÍøÂç±í,200=¼¯ÖĞÆ÷,300=×¨±äÖÕ¶Ë,400=¹«±äÖÕ¶Ë,500=²É¼¯Æ÷,600=Í¨ĞÅÄ£¿é

#define RouterCheckTimerVal     (60*10)//ÏÂ´ÎÔØ²¨Â·ÓÉÆ÷¼ì²éÃë¶¨Ê±Öµ

void Terminal_ReadMeter_3762_CHINT(u32 PORTn)//ÕıÌ©ÔØ²¨Ä£¿é
{
	u32 i;
	u32 x;
	u32 y;
	u32 z;
	u64 d64a;
	u64 d64b;
//	u8 * p8rxbuff;
//	u8 * p8txbuff;
	UARTCtrl_TypeDef * UARTCtrl;
//	u16 * p16timer;
//	u32 * p32;
	
//	p8rxbuff=(u8 *)Get_ADDR_UARTnRx(PORTn);
//	p8txbuff=(u8 *)Get_ADDR_UARTnTx(PORTn);
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
//	p16timer=(u16 *)Get_ADDR_UARTnTimer(PORTn);
	
	switch(Terminal_Router->RouterInitTask)//Â·ÓÉÆ÷³­¶ÁÈÎÎñ0-99¹«¹²³õÊ¼»¯,100-199·Ö³§¼Ò³õÊ¼»¯,>=200Â·ÓÉ³­±í
	{
		case 100://²éÉ¾³ı
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0://ÇåÉ¾³ı»òÌí¼Ó½ÚµãÊı¼ÆÊı
					Terminal_Router->TempCount=0;//É¾³ı»òÌí¼Ó½ÚµãÊı¼ÆÊı
					Terminal_Router->RouterInitSubTask++;//×ÓÈÎÎñ
					break;
				case 1://²éÉ¾³ı
					for(i=0;i<100;i++)
					{
						if(Terminal_Router->TempCount>=Terminal_Router->NoteNum)
						{
							Terminal_Router->RouterInitSubTask=0;//×ÓÈÎÎñ
							Terminal_Router->RouterInitTask++;//Â·ÓÉÆ÷³­¶ÁÈÎÎñ0-99¹«¹²³õÊ¼»¯,100-199·Ö³§¼Ò³õÊ¼»¯,>=200Â·ÓÉ³­±í
							return;
						}
						d64a=MEMReadReg((u32)&Terminal_Note->List[Terminal_Router->TempCount].Addr,6);
						z=ADDR_AFN04F10;
						for(x=0;x<AFN04F10MaxPn;x++)
						{
							d64b=MEMReadReg(z+6,6);
							if(d64a==d64b)
							{//µØÖ·ÏàÍ¬
								y=MEMReadReg(z+2,2);
								if(y!=0x0)
								{//²âÁ¿µãÓĞĞ§
									if((MEMReadReg(z+4,1)&0x1f)==31)
									{//¶Ë¿ÚºÅ31
										MEMWriteReg(x+1,(u32)&Terminal_Note->List[Terminal_Router->TempCount].MeterNo,2);//¶ÔÓ¦µçÄÜ±í/½»Á÷²ÉÑù×°ÖÃĞòºÅ(´Ó1¿ªÊ¼)
										break;
									}
								}
							}
							z+=LEN_AFN04F10_Pn;
						}
						if(x==AFN04F10MaxPn)
						{//É¾³ı
							x=(Terminal_Router->NoteNum-(Terminal_Router->TempCount+1))*LEN_NoteList;//´ÓµØÖ·±íÖĞÉ¾È¥
							MEMRead(ADDR_NoteList+(Terminal_Router->TempCount*LEN_NoteList),ADDR_NoteList+((Terminal_Router->TempCount+1)*LEN_NoteList),x);
							Terminal_Router->NoteNum--;
						}
						Terminal_Router->TempCount++;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//Â·ÓÉÆ÷³­¶ÁÈÎÎñ0-99¹«¹²³õÊ¼»¯,100-199·Ö³§¼Ò³õÊ¼»¯,>=200Â·ÓÉ³­±í
					break;
			}
			break;
		case 101://²éÌí¼Ó
			switch(Terminal_Router->RouterInitSubTask)
			{
				case 0://ÇåÉ¾³ı»òÌí¼Ó½ÚµãÊı¼ÆÊı
					Terminal_Router->TempCount=0;//É¾³ı»òÌí¼Ó½ÚµãÊı¼ÆÊı
					Terminal_Router->RouterInitSubTask++;//×ÓÈÎÎñ
					break;
				case 1://²éÌí¼Ó
					for(i=0;i<100;i++)
					{
						if(Terminal_Router->TempCount>=AFN04F10MaxPn)
						{
							Terminal_Router->RouterInitSubTask=0;//×ÓÈÎÎñ
							Terminal_Router->RouterInitTask++;//Â·ÓÉÆ÷³­¶ÁÈÎÎñ0-99¹«¹²³õÊ¼»¯,100-199·Ö³§¼Ò³õÊ¼»¯,>=200Â·ÓÉ³­±í
							return;
						}
						z=ADDR_AFN04F10+(LEN_AFN04F10_Pn*Terminal_Router->TempCount);
						x=MEMReadReg(z+2,2);
						if(x!=0x0)
						{//²âÁ¿µãÓĞĞ§
							if((MEMReadReg(z+4,1)&0x1f)==31)
							{//¶Ë¿ÚºÅ31
								d64a=MEMReadReg(z+6,6);
								for(y=0;y<Terminal_Router->NoteNum;y++)
								{
									d64b=MEMReadReg((u32)&Terminal_Note->List[y].Addr,6);
									if(d64a==d64b)
									{
										break;
									}
								}
								if(y==Terminal_Router->NoteNum)
								{//Ìí¼Ó
									MEMClr(0,ADDR_NoteList+(Terminal_Router->NoteNum*LEN_NoteList),LEN_NoteList);
									MEMRead((u32)&Terminal_Note->List[Terminal_Router->NoteNum].Addr,ADDR_AFN04F10+(LEN_AFN04F10_Pn*Terminal_Router->TempCount)+6,6);
									Terminal_Note->List[Terminal_Router->NoteNum].MeterNo=Terminal_Router->TempCount+1;//¶ÔÓ¦µçÄÜ±í/½»Á÷²ÉÑù×°ÖÃĞòºÅ(´Ó1¿ªÊ¼)
									Terminal_Router->NoteNum++;
								}
							}
						}
						Terminal_Router->TempCount++;
					}
					break;
				default:
					Terminal_Router->RouterInitTask=0;//Â·ÓÉÆ÷³­¶ÁÈÎÎñ0-99¹«¹²³õÊ¼»¯,100-199·Ö³§¼Ò³õÊ¼»¯,>=200Â·ÓÉ³­±í
					break;
			}
			break;
		case 102:
			Terminal_Router->RouterInitTask=200;//Â·ÓÉÆ÷³­¶ÁÈÎÎñ0-99¹«¹²³õÊ¼»¯,100-199·Ö³§¼Ò³õÊ¼»¯,>=200Â·ÓÉ³­±í
			break;
		
		
		case 200://>=200Â·ÓÉ³­±í
//			p32=(u32*)(ADDR_E4_ENTRY);
//			if((p32[64]==ADDR_E4_ENTRY)||(Terminal_Router->UpDateTask!=0))//Èí¼ş¸üĞÂÈÎÎñ
//			{
//				UpData_CHINT(PORTn);//Â·ÓÉÈí¼ş¸üĞÂ
//				break;
//			}

			if(UARTCtrl->Task==0)//0=¿ÕÏĞ
			{
				if(Terminal_Router->AFN04F10!=0)//AFN04F10ÉèÖÃ±ä»¯±êÖ¾0=Ã»,1=±ä»¯
				{
					Terminal_Router->RouterInitTask=0;//Â·ÓÉÆ÷³­¶ÁÈÎÎñ0-99¹«¹²³õÊ¼»¯,100-199·Ö³§¼Ò³õÊ¼»¯,>=200Â·ÓÉ³­±í
					break;
				}
				
				if(Terminal_Ram->RouterCheck_S_Timer==0)//24 ÔØ²¨Â·ÓÉÆ÷¼ì²éÃë¶¨Ê±Æ÷
				{
					Terminal_Ram->RouterCheck_S_Timer=RouterCheckTimerVal;//ÏÂ´ÎÔØ²¨Â·ÓÉÆ÷¼ì²éÃë¶¨Ê±Æ÷
					Terminal_Router->RouterCtrl=4;//Â·ÓÉÆ÷¿ØÖÆ0=¿Õ,1=ÖØÆô,2=ÔİÍ£,3=»Ö¸´,4=¼ì²â;Íê³Éºó×Ô¶¯»Øµ½0
					break;
				}
				if(MEMReadReg(ADDR_AFN05F49+30,1)==0x55)//ÃüÁîÖ¸¶¨Í¨ĞÅ¶Ë¿ÚÔİÍ£³­±í
				{
					WarningOccur(PORTn,(u8 *)"ÔØ²¨ÃüÁîÔİÍ£³­±í");//¸æ¾¯·¢Éú,Èë¿Ú¸æ¾¯´úÂëºÍ¸æ¾¯×Ö·û´®
					break;
				}
				i=MEMReadReg(ADDR_AFN04F33+((14+(4*24))*30)+1,1);//ÖÕ¶Ë³­±íÔËĞĞ²ÎÊıÉèÖÃ,¶Ë¿Ú31
				if((i&0x01)!=0x0)
				{//D0ÖÃ"1"²»ÔÊĞí×Ô¶¯³­±í£¬ÖÃ"0" ÒªÇóÖÕ¶Ë¸ù¾İ³­±íÊ±¶Î×Ô¶¯³­±í
					WarningOccur(PORTn,(u8 *)"ÔØ²¨²»ÔÊĞí×Ô¶¯³­±í");//¸æ¾¯·¢Éú,Èë¿Ú¸æ¾¯´úÂëºÍ¸æ¾¯×Ö·û´®
					break;
				}
				if(UARTCtrl->RMFlag==0)//1=³­±í½øĞĞÖĞ,0=³­±í¼ä¸ôÔİÍ£
				{
					WarningOccur(PORTn,(u8 *)"ÔØ²¨·Ç³­±íÊ±¶Î");//¸æ¾¯·¢Éú,Èë¿Ú¸æ¾¯´úÂëºÍ¸æ¾¯×Ö·û´®
					break;
				}
			}
			if(Terminal_Router->NoteNum==0)
			{//½Úµã±í¿Õ
				DisplayRouterVer(PORTn);//ÏÔÊ¾Â·ÓÉ³§¼ÒºÍ°æ±¾ºÅ
				break;
			}
			
			if(UARTCtrl->RMKeyUser==0)//³­¶ÁÖØµã»§±êÖ¾,0=³£¹æ³­¶Á,1=ÖØµã»§³­¶Á
			{
				GeneralReadMeter_3762_CHINT(PORTn);//ÔØ²¨Ä£¿é,³£¹æ³­±í
			}
			else
			{
				KeyUserReadMeter_3762_CHINT(PORTn);//ÔØ²¨Ä£¿é,ÖØµã»§³­±í
			}
			break;
		default:
			Terminal_Router->RouterInitTask=0;//Â·ÓÉÆ÷³­¶ÁÈÎÎñ0-99¹«¹²³õÊ¼»¯,100-199·Ö³§¼Ò³õÊ¼»¯,>=200Â·ÓÉ³­±í
			break;
	}
}


