gdgly/NUC97X_JS/STM32F4xx/Terminal698/Terminal_ReadMeter_3762_CHINT.c
extern const u32 DL645_2007_RMLib[];
u32 Get_RM_DL645_2007_MaxFn(void);
extern const u32 DL645_1997_RMLib[];
u32 Get_RM_DL645_1997_MaxFn(void);

void GeneralReadMeter_3762_CHINT(u32 PORTn)//ÔØ²¨Ä£¿é,³£¹æ³­±í
{
	u32 i;
	u32 x;
	u32 y;
	u32 ClassNo;
	u32 ListNo;
	u32 Fn;
	u32 Pn;
	u32 Protocol;
	u32 AddrAFN04F10;
	u64 d64a;
	u64 d64b;
	
	u8 * p8RMLib;
	u8 * p8rxbuff;
	u8 * p8txbuff;
	u8 * p8FnData;
	UARTCtrl_TypeDef * UARTCtrl;
	
	p8rxbuff=(u8 *)Get_ADDR_UARTnRx(PORTn);
	p8txbuff=(u8 *)Get_ADDR_UARTnTx(PORTn);
	p8FnData=(u8 *)Get_ADDR_UARTnFnDataBuff(PORTn);
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);

	switch(UARTCtrl->Task)//UART_3762½ÓÊÕ·¢ËÍ;0=¿ÕÏĞ,1=Íê³É1Ö¡·¢ÊÕ,2=½ÓÊÕ³¬Ê±(»ò´íÎó),3=Æô¶¯·¢ËÍ,4=ÕıÔÚ·¢ËÍ,5=ÕıÔÚ½ÓÊÕ,6=×¼±¸·¢ËÍ
	{
		case 2://2=½ÓÊÕ³¬Ê±(»ò´íÎó)
			UARTCtrl->Task=0;//¿ÕÏĞ1´Î
			break;
		case 0://0=¿ÕÏĞ
			i=MEMReadReg(ADDR_YMDHMS+1,2);
			if((i>0x2350)||(i<0x0010))
			{//ÔÚÃ¿ÈÕ0µã¸½½üÔİÍ£³­±í
				UARTCtrl->Task=0;//0=¿ÕÏĞ,1=Íê³É1Ö¡·¢ÊÕ,2=½ÓÊÕ³¬Ê±(»ò´íÎó),3=Æô¶¯·¢ËÍ,4=ÕıÔÚ·¢ËÍ,5=ÕıÔÚ½ÓÊÕ
				break;
			}

			ListNo=UARTCtrl->GRMCount;//³­¶ÁµçÄÜ±í¼ÆÊı(Ïş³ÌºÍÕıÌ©ÔØ²¨)
			if(ListNo>=Terminal_Router->NoteNum)
			{//³­±í¼ÆÊı>=µ±Ç°Â·ÓÉÆ÷ÖĞ×Ü´Ó½ÚµãÊı
				ListNo=0;
				UARTCtrl->GRMCount=0;
				break;
			}
			x=Terminal_Note->List[ListNo].MeterNo;//È¡¶ÔÓ¦µçÄÜ±í/½»Á÷²ÉÑù×°ÖÃĞòºÅ(´Ó1¿ªÊ¼)
			if((x==0)||(x>AFN04F10MaxPn))
			{//ĞòºÅ´í
		RMOK:
				Terminal_Note->List[ListNo].RMErr=0;//µ±Ç°³­±íÊ§°Ü±êÖ¾:0=¿Õ,1=ÖÁÉÙÓĞ1¸öÊı¾İ±êÊ¶³­¶ÁÊ§°Ü
				goto RMEND;
			}
			i=MEMReadReg(ADDR_AFN04F33+((14+(4*24))*30)+1,1);//ÖÕ¶Ë³­±íÔËĞĞ²ÎÊıÉèÖÃ,¶Ë¿Ú31
			if((i&0x02)!=0x0)
			{//D1ÖÃ"1"ÒªÇóÖÕ¶ËÖ»³­ÖØµã±í£¬ÖÃ"0"ÒªÇóÖÕ¶Ë³­ËùÓĞ±í
				y=MEMReadReg(ADDR_AFN04F35,1);//Ì¨Çø¼¯ÖĞ³­±íÖØµã»§ÉèÖÃ
				if(y>MaxKeyUser)
				{
					y=MaxKeyUser;
				}
				for(i=0;i<y;i++)
				{
					if(MEMReadReg(ADDR_AFN04F35+1+(2*i),2)==x)
					{
						break;
					}
				}
				if(i==y)
				{//²»ÊÇÖØµã»§
					goto RMOK;//²»³­,Ö±½Ó·µ»Ø³­¶Á³É¹¦
				}
			}
			x--;
			
			AddrAFN04F10=ADDR_AFN04F10+(x*LEN_AFN04F10_Pn);
			d64a=MEMReadReg(AddrAFN04F10+6,6);//È¡ÅäÖÃµÄÍ¨ĞÅµØÖ·
			Pn=MEMReadReg(AddrAFN04F10+2,2);//È¡ÅäÖÃµÄ²âÁ¿µãºÅ
			if(Pn==0)
			{//ÅäÖÃÉ¾³ı
				goto RMOK;//²»³­,Ö±½Ó·µ»Ø³­¶Á³É¹¦
			}
			i=MEMReadReg(ADDR_AFN04F30+(Pn-1),1);//Ì¨Çø¼¯ÖĞ³­±íÍ£³­/Í¶³­ÉèÖÃ(²âÁ¿µãºÅ)
			if(i!=0)
			{//Í£³­
				goto RMOK;//²»³­,Ö±½Ó·µ»Ø³­¶Á³É¹¦
			}
			if(Terminal_Note->List[ListNo].ReCount>=1)
			{//³­±íÖØ·¢´ÎÊı>=1
				Terminal_Note->List[ListNo].RMErr=1;//µ±Ç°³­±íÊ§°Ü±êÖ¾:0=¿Õ,1=ÖÁÉÙÓĞ1¸öÊı¾İ±êÊ¶³­¶ÁÊ§°Ü
				ReadMeterNote_Fail(PORTn,Pn);//¼¯ÖĞ³­±íµç±í³­¶ÁĞÅÏ¢.Ê§°Ü
				goto RMEND;//½áÊø³­±í
			}
			Terminal_Note->List[ListNo].ReCount++;//³­±íÖØ·¢¼ÆÊı+1
			Protocol=MEMReadReg(AddrAFN04F10+5,1);//È¡Í¨ĞÅĞ­ÒéÀàĞÍ:1=DL/T645-1997,30=DL/T645-2007
			ClassNo=MEMReadReg(AddrAFN04F10+26,1);//È¡´óĞ¡ÀàºÅ
			
			while(1)
			{
				if(Protocol==1)
				{//DL/T645-1997
					i=Get_RM_DL645_1997_MaxFn();
				}
				else
				{//DL/T645-2007
					i=Get_RM_DL645_2007_MaxFn();
				}
				if(Terminal_Note->List[ListNo].FnCount>=i)
				{//Fn¼ÆÊı>=×î´óFn¸öÊı,±¾ÂÖ³­±í½áÊø
			RMEND:
					DisplayRouterVer(PORTn);//ÏÔÊ¾Â·ÓÉ³§¼ÒºÍ°æ±¾ºÅ
					Terminal_Note->List[ListNo].RMFlag=2;//³­±í±êÖ¾;0=ÉÏµç»òÈÕ¸üĞÂ,1=ÃüÁîÇ¿ÖÆÖØ³­,2=Íê³ÉÒ»ÂÖ³­±í
			 		Terminal_Note->List[ListNo].FnCount=0;//Fn¼ÆÊı
					Terminal_Note->List[ListNo].DICount=0;//³­±íÊı¾İ±êÊ¶¼ÆÊı
					Terminal_Note->List[ListNo].ReCount=0;//³­±íÖØ·¢´ÎÊı
					if(Terminal_Note->List[ListNo].RMErr==0)//µ±Ç°³­±íÊ§°Ü±êÖ¾:0=¿Õ,1=ÖÁÉÙÓĞ1¸öÊı¾İ±êÊ¶³­¶ÁÊ§°Ü
					{
						Terminal_Note->List[ListNo].OldRMErr=2;//¼Ä´æ³­±í³É¹¦Ê§°Ü±êÖ¾:0=¿Õ,1=ÖÁÉÙÓĞ1¸öÊı¾İ±êÊ¶³­¶ÁÊ§°Ü,2=³É¹¦
					}
					else
					{
						if(Terminal_Note->List[ListNo].OldRMErr<2)//¼Ä´æ³­±í³É¹¦Ê§°Ü±êÖ¾:0=¿Õ,1=ÖÁÉÙÓĞ1¸öÊı¾İ±êÊ¶³­¶ÁÊ§°Ü,2=³É¹¦
						{
							Terminal_Note->List[ListNo].OldRMErr=1;//¼Ä´æ³­±í³É¹¦Ê§°Ü±êÖ¾:0=¿Õ,1=ÖÁÉÙÓĞ1¸öÊı¾İ±êÊ¶³­¶ÁÊ§°Ü,2=³É¹¦
						}
					}
					Terminal_Note->List[ListNo].RMErr=0;//µ±Ç°³­±íÊ§°Ü±êÖ¾:0=¿Õ,1=ÖÁÉÙÓĞ1¸öÊı¾İ±êÊ¶³­¶ÁÊ§°Ü
					UARTCtrl->GRMCount++;//³­¶ÁµçÄÜ±í¼ÆÊı(Ïş³ÌºÍÕıÌ©ÔØ²¨)
					return;
				}

				if(Protocol==1)
				{//DL/T645-1997
					i=DL645_1997_RMLib[Terminal_Note->List[ListNo].FnCount];
				}
				else
				{//DL/T645-2007
					i=DL645_2007_RMLib[Terminal_Note->List[ListNo].FnCount];
				}
				if(i==0)
				{//±¾FnÊÇ¿Õ
					goto NEXT_Fn;
				}
				p8RMLib=(u8 *)i;//³­±í¿â
				if((p8RMLib[3]&0x04)==0)//³­±íÖ§³Ö:B2=ÔØ²¨³­±í,B1=RS485³­±í,B0=ÄÚ²¿½»²É³­±í
				{
					goto NEXT_Fn;
				}
				
				
				y=0;
				if((p8RMLib[4]&0x01)!=0)//Êı¾İ·ÖÀà:B5=ÔÂ¶³½á,B4=³­±íÈÕ¶³½á,B3=ÈÕ¶³½á,B2=ÇúÏß¶³½á,B1=Ğ¡Ê±¶³½á,B0=ÊµÊ±
				{//1ÀàÊı¾İ,ÊµÊ±
					Fn=p8RMLib[0];//È¡ÊµÊ±Fn
					y=Class1Data_Fn(ClassNo,Fn);//1ÀàÊı¾İFnÅäÖÃ,Èë¿ÚClassNoµÄD7-D4´óÀàºÅD3-D0Ğ¡ÀàºÅ,Fn;·µ»Ø0=²»Ö§³Ö,1=Ö§³Ö
					//i=GetClass1DataAddr(Fn,Pn);//È¡Àà1Êı¾İ´æÖüµØÖ·,·µ»Ø0±íÊ¾Ã»ÕÒµ½,ÓĞĞ§Êı¾İ³¤¶È·ÅADDR_Terminal_ClassDataLen
					//if(i!=0)
					//{
					//}
				}
				x=0;
				if((p8RMLib[4]&0x08)!=0)//Êı¾İ·ÖÀà:B5=ÔÂ¶³½á,B4=³­±íÈÕ¶³½á,B3=ÈÕ¶³½á,B2=ÇúÏß¶³½á,B1=Ğ¡Ê±¶³½á,B0=ÊµÊ±
				{//2ÀàÊı¾İB3=ÈÕ¶³½á
					Fn=p8RMLib[7];//È¡ÈÕ¶³½áFn
					i=GetClass2SourceDataAddr(Fn,Pn);//È¡Àà2Ô­Ê¼Êı¾İ´æÖüµØÖ·,·µ»Ø0±íÊ¾Ã»ÕÒµ½,ÓĞĞ§Êı¾İ³¤¶È·ÅADDR_Terminal_ClassDataLen
					if(i!=0)
					{
						MEMRead(ADDR_DATABUFF,i,5);//È¡Ô­³­±íÊ±¼äÄêÔÂÈÕÊ±·Ö
						x|=DataComp(ADDR_DATABUFF+2,ADDR_YMDHMS+3,3);//Êı¾İ±È½Ï,·µ»Ø0=ÏàµÈ;µ±Byte>8Ê±·µ»Ø1=²»ÏàµÈ;µ±Byte<=8Ê±1=Data1>Data2,2=Data1<Data2
					}
				}
				if((p8RMLib[4]&0x20)!=0)//Êı¾İ·ÖÀà:B5=ÔÂ¶³½á,B4=³­±íÈÕ¶³½á,B3=ÈÕ¶³½á,B2=ÇúÏß¶³½á,B1=Ğ¡Ê±¶³½á,B0=ÊµÊ±
				{//2ÀàÊı¾İB5=ÔÂ¶³½á
					Fn=p8RMLib[9];//È¡ÔÂ¶³½áFn
					i=GetClass2SourceDataAddr(Fn,Pn);//È¡Àà2Ô­Ê¼Êı¾İ´æÖüµØÖ·,·µ»Ø0±íÊ¾Ã»ÕÒµ½,ÓĞĞ§Êı¾İ³¤¶È·ÅADDR_Terminal_ClassDataLen
					if(i!=0)
					{
						MEMRead(ADDR_DATABUFF,i,5);//È¡Ô­³­±íÊ±¼äÄêÔÂÈÕÊ±·Ö
						x|=DataComp(ADDR_DATABUFF+3,ADDR_YMDHMS+4,2);//Êı¾İ±È½Ï,·µ»Ø0=ÏàµÈ;µ±Byte>8Ê±·µ»Ø1=²»ÏàµÈ;µ±Byte<=8Ê±1=Data1>Data2,2=Data1<Data2
					}
				}
				if(x==0)
				{//³­±íÊ±±êÏàÍ¬
					if(Terminal_Note->List[ListNo].RMFlag==1)//³­±í±êÖ¾;0=ÉÏµç»òÈÕ¸üĞÂ,1=ÃüÁîÇ¿ÖÆÖØ³­,2=Íê³É
					{
						y|=Class2Data_Fn(ClassNo,Fn);//2ÀàÊı¾İFnÅäÖÃ,Èë¿ÚClassNoµÄD7-D4´óÀàºÅD3-D0Ğ¡ÀàºÅ,Fn;·µ»Ø0=²»Ö§³Ö,1=Ö§³Ö
					}
				}
				else
				{
					y|=Class2Data_Fn(ClassNo,Fn);//2ÀàÊı¾İFnÅäÖÃ,Èë¿ÚClassNoµÄD7-D4´óÀàºÅD3-D0Ğ¡ÀàºÅ,Fn;·µ»Ø0=²»Ö§³Ö,1=Ö§³Ö
				}
				if(y==0x0)
				{//±¾Fn²»³­
		NEXT_Fn:
					Terminal_Note->List[ListNo].FnCount++;//Fn¼ÆÊı+1
					Terminal_Note->List[ListNo].DICount=0;//³­±íÊı¾İ±êÊ¶¼ÆÊı
					Terminal_Note->List[ListNo].ReCount=0;//ÖØ·¢¼ÆÊı
					continue;
				}
				if(p8RMLib[1]==0x0)
				{//±¾Fn³­±íÃüÁîÊı=0
					if((p8RMLib[4]&0x01)!=0)//Êı¾İ·ÖÀà:B5=ÔÂ¶³½á,B4=³­±íÈÕ¶³½á,B3=ÈÕ¶³½á,B2=ÇúÏß¶³½á,B1=Ğ¡Ê±¶³½á,B0=ÊµÊ±
					{//1ÀàÊı¾İ,ÊµÊ±
						Fn=p8RMLib[0];//È¡ÊµÊ±Fn
						switch(Fn)
						{
						//F33 µ±Ç°ÕıÏòÓĞ/ÎŞ¹¦£¨×éºÏÎŞ¹¦1£©µçÄÜÊ¾Öµ¡¢Ò»/ËÄÏóÏŞÎŞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
						//F34 µ±Ç°·´ÏòÓĞ/ÎŞ¹¦£¨×éºÏÎŞ¹¦2£©µçÄÜÊ¾Öµ¡¢¶ş/ÈıÏóÏŞÎŞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
						//F35 µ±ÔÂÕıÏòÓĞ/ÎŞ¹¦×î´óĞèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
						//F36 µ±ÔÂ·´ÏòÓĞ/ÎŞ¹¦×î´óĞèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
							case 33:
							case 34:
							case 35:
							case 36:
						//F37 ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©ÕıÏòÓĞ/ÎŞ¹¦£¨×éºÏÎŞ¹¦1£©µçÄÜÊ¾Öµ¡¢Ò»/ËÄÏóÏŞÎŞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
						//F38 ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©·´ÏòÓĞ/ÎŞ¹¦£¨×éºÏÎŞ¹¦2£©µçÄÜÊ¾Öµ¡¢¶ş/ÈıÏóÏŞÎŞ¹¦µçÄÜÊ¾Öµ£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
						//F39 ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©ÕıÏòÓĞ/ÎŞ¹¦×î´óĞèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜM¡Ü12£©
						//F40 ÉÏÔÂ£¨ÉÏÒ»½áËãÈÕ£©·´ÏòÓĞ/ÎŞ¹¦×î´óĞèÁ¿¼°·¢ÉúÊ±¼ä£¨×Ü¡¢·ÑÂÊ1¡«M£¬1¡ÜMÜ12©
							case 37:
							case 38:
							case 39:
							case 40:
								break;
							default:
								goto NEXT_Fn;
						}
						p8FnData[0]=0x53;//Ç¿ÖÆ³­±í³É¹¦
						ReadMeter_SaveFnData(Fn,Pn,(u32)p8FnData,p8RMLib);//´æÖü³­±íFnÊı¾İ
						goto NEXT_Fn;
					}
				}
				if(Terminal_Note->List[ListNo].DICount==0)//³­±íÊı¾İ±êÊ¶¼ÆÊı
				{//³­±íÊı¾İ±êÊ¶¼ÆÊı=0,ÇåFnÊı¾İ»º³å
					MEMClr(0xee,(u32)p8FnData,Get_LEN_UARTnFnDataBuff(PORTn));
				}
				if(Terminal_Note->List[ListNo].DICount>=p8RMLib[1])
				{//³­±íÊı¾İ±êÊ¶¼ÆÊı>=FnĞè·¢ÃüÁîÊı;±¾Fn³­±íÍê³É
					ReadMeter_SaveFnData(Fn,Pn,(u32)p8FnData,p8RMLib);//´æÖü³­±íFnÊı¾İ
					goto NEXT_Fn;
				}
				
				
				p8txbuff[0]=0x68;
				p8txbuff[3]=0x41;//¿ØÖÆÂëÎª0x41
				p8txbuff[4]=4;//Í¨ĞÅÄ£¿é±êÊ¶=1
				p8txbuff[5]=0;
				p8txbuff[6]=0;
				p8txbuff[7]=0;
				p8txbuff[8]=0;
				p8txbuff[9]=0;
				MEMClr(0,((u32)p8txbuff)+10,6);
				MEMRead(((u32)p8txbuff)+10,ADDR_TERMINALADDR,2);;//Ö÷½ÚµãµØÖ·(Ô´µØÖ·)(Í¬ÖÕ¶ËµØÖ·)
				MEMWriteReg(d64a,((u32)p8txbuff)+16,6);//´Ó½ÚµãµØÖ·(Ä¿µÄµØÖ·)
				p8txbuff[22]=0x13;//AFN=13H
				p8txbuff[23]=1;//Fn=1
				p8txbuff[24]=0;
				if(Protocol==1)
				{//dl645-1997
					p8txbuff[25]=1;//2;//×ª·¢Êı¾İ±êÊ¶ÀàĞÍ=0Í¸Ã÷´«Êä,1=DL645-1997,2=DL645-2007
					p8txbuff[26]=0;//¸½Êô½ÚµãÊı=0
					p8txbuff[27]=14;//DL645±¨ÎÄ³¤¶È
					p8txbuff[28]=0x68;
					MEMWriteReg(d64a,((u32)p8txbuff)+29,6);//´Ó½ÚµãµØÖ·(Ä¿µÄµØÖ·)
					p8txbuff[35]=0x68;
					p8txbuff[36]=0x01;
					p8txbuff[37]=2;
					p8txbuff[38]=p8RMLib[10+(3*Terminal_Note->List[ListNo].DICount)]+0x33;//È¡DIÍ¬Ê±¼Ó0x33
					p8txbuff[39]=p8RMLib[10+(3*Terminal_Note->List[ListNo].DICount)+1]+0x33;
					p8txbuff[40]=0;
					p8txbuff[41]=0x16;
					for(i=0;i<12;i++)
					{
						p8txbuff[40]+=p8txbuff[28+i];
					}
				}
				else
				{//dl645-2007
					i=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)];
					i|=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)+1]<<8;
					i|=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)+2]<<16;
					i|=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)+3]<<24;
					switch(i)
					{//ÒÔÏÂÃüÁîÒòÖ¡Ì«³¤²»³­
						case 0x03300101://F27 ×î½üÒ»´Îµç±íÇåÁã·¢ÉúÊ±¿Ì
						case 0x03300201://F27 ×î½üÒ»´ÎĞèÁ¿ÇåÁã·¢ÉúÊ±¿Ì
						case 0x03300501://F166 ×î½üÒ»´ÎµçÄÜ±íÊ±¶Î²ÎÊıĞŞ¸ÄÊ±¼ä
						case 0x03300001://(½öÕıÌ©)F27 ×î½üÒ»´Î±à³Ì·¢ÉúÊ±¿Ì
						case 0x1E0002FF://(½öÕıÌ©)F161 ÉÏ1-10´ÎºÏÕ¢²Ù×÷Õß´úÂë
						case 0x1E0001FF://(½öÕıÌ©)F161 ÉÏ1-10´ÎºÏÕ¢·¢ÉúÊ±¿Ì
						case 0x1D0002FF://(½öÕıÌ©)F161 ÉÏ1-10´ÎÌøÕ¢²Ù×÷Õß´úÂë
						case 0x1D0001FF://(½öÕıÌ©)F161 ÉÏ1-10´ÎÌøÕ¢·¢ÉúÊ±¿Ì
							Terminal_Note->List[ListNo].ReCount=0;//³­±íÖØ·¢¼ÆÊı=0
							Terminal_Note->List[ListNo].DICount++;//³­±íÃüÁî¼ÆÊı
							return;
					}
					p8txbuff[25]=2;//2;//×ª·¢Êı¾İ±êÊ¶ÀàĞÍ=0Í¸Ã÷´«Êä,1=DL645-1997,2=DL645-2007
					p8txbuff[26]=0;//¸½Êô½ÚµãÊı=0
					p8txbuff[27]=16;//DL645±¨ÎÄ³¤¶È
					p8txbuff[28]=0x68;
					MEMWriteReg(d64a,((u32)p8txbuff)+29,6);//´Ó½ÚµãµØÖ·(Ä¿µÄµØÖ·)
					p8txbuff[35]=0x68;
					p8txbuff[36]=0x11;
					p8txbuff[37]=4;
					p8txbuff[38]=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)]+0x33;//È¡DIÍ¬Ê±¼Ó0x33
					p8txbuff[39]=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)+1]+0x33;
					p8txbuff[40]=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)+2]+0x33;
					p8txbuff[41]=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)+3]+0x33;
					p8txbuff[42]=0;
					p8txbuff[43]=0x16;
					for(i=0;i<14;i++)
					{
						p8txbuff[42]+=p8txbuff[28+i];
					}
				}
				i=28+p8txbuff[27]+2;//Ğè×Ü·¢ËÍ×Ö½ÚÊı
				p8txbuff[1]=i;
				p8txbuff[2]=i>>8;
				Uart_3762_CS((u32)p8txbuff);//ºÍĞ£Ñé¼ÆËã²¢Ğ´Èë(Í¬Ê±Ğ´Èë½áÊø0x16)ºÍ±È½Ï,·µ»Ø0=ÕıÈ·1=´íÎó,Èë¿Ú½ÓÊÕ»ò·¢ËÍ»º³å
				UARTCtrl->TxByte=i;//·¢ËÍ×Ö½ÚÊı(°ë×Ö¶ÔÆë)
				UARTCtrl->Task=3;//0=¿ÕÏĞ,1=Íê³É1Ö¡·¢ÊÕ,2=½ÓÊÕ³¬Ê±(»ò´íÎó),3=Æô¶¯·¢ËÍ,4=ÕıÔÚ·¢ËÍ,5=ÕıÔÚ½ÓÊÕ
				UARTCtrl->RouterTimeOut=60000/10;//·¢ËÍºó½ÓÊÕ³¬Ê±¶¨Ê±Öµms/10(°ë×Ö¶ÔÆë)

