gdgly/NUC97X_JS/STM32F4xx/Terminal698/Terminal_ReadMeter_3762_CHINT.c
				//ÏÔÊ¾³­±íµØÖ·
				CopyString((u8 *)"ÔØ²¨ÔÚ³­",(u8*)ADDR_DATABUFF);//¿½±´×Ö·û´®;·µ»Ø¿½±´×Ö·û´®×Ö½ÚÊı(²»¼Æ½áÊø0)
				for(i=0;i<6;i++)
				{
					x=p8txbuff[16+5-i];
					MEMWriteReg((x>>4)+0x30,ADDR_DATABUFF+8+(i*2),1);
					MEMWriteReg((x&0xf)+0x30,ADDR_DATABUFF+8+(i*2)+1,1);
				}
				MEMWriteReg(0,ADDR_DATABUFF+8+12,1);
				WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//¸æ¾¯·¢Éú,Èë¿Ú¸æ¾¯´úÂëºÍ¸æ¾¯×Ö·û´®
				return;
			}
			//break;
		case 1://1=Íê³É1Ö¡·¢ÊÕ
			UARTCtrl->Task=0;//¿ÕÏĞ1´Î
			ListNo=UARTCtrl->GRMCount;//³­¶ÁµçÄÜ±í¼ÆÊı(Ïş³ÌºÍÕıÌ©ÔØ²¨)
			if(ListNo>=Terminal_Router->NoteNum)
			{//³­±í¼ÆÊı>=µ±Ç°Â·ÓÉÆ÷ÖĞ×Ü´Ó½ÚµãÊı
				ListNo=0;
				UARTCtrl->GRMCount=0;
			}
			x=Terminal_Note->List[ListNo].MeterNo;//È¡¶ÔÓ¦µçÄÜ±í/½»Á÷²ÉÑù×°ÖÃĞòºÅ(´Ó1¿ªÊ¼)
			if((x==0)||(x>AFN04F10MaxPn))
			{//ĞòºÅ´í
		rxerr:
				break;
			}
			x--;
			x=ADDR_AFN04F10+2+(LEN_AFN04F10_Pn*x);
			Pn=MEMReadReg(x,2);
			if(Pn==0)
			{//²âÁ¿µãºÅ´í
				goto rxerr;
			}
			i=MEMReadReg(x+3,1);//Í¨ĞÅĞ­ÒéÀàĞÍ BIN 1 
			Protocol=0;
			if(i==MEMReadReg(ADDR_Protocol_No+1,1))
			{//DL/T645-1997(1)
				Protocol=1;
			}
			if(i==MEMReadReg(ADDR_Protocol_No+2,1))
			{//DL/T645-2007(30)
				Protocol=2;
			}
			if(Protocol==0)
			{//Í¨ĞÅĞ­Òé²»Öª
				goto rxerr;
			}
			if(Protocol==1)
			{//DL/T645-1997
				i=DL645_1997_RMLib[Terminal_Note->List[ListNo].FnCount];
			}
			else
			{//DL/T645-2007
				i=DL645_2007_RMLib[Terminal_Note->List[ListNo].FnCount];
			}
			p8RMLib=(u8 *)i;//³­±í¿â
			
			d64a=MEMReadReg(x+4,6);//È¡ÅäÖÃµÄÍ¨ĞÅµØÖ·
			i=p8rxbuff[1]+(p8rxbuff[2]<<8);
			if(i<=16)
			{//·ñÈÏ»Ø´ğ
				goto rxerr;
//				Terminal_Note->List[ListNo].ReCount=0;//³­±íÖØ·¢¼ÆÊı=0
//				Terminal_Note->List[ListNo].DICount++;//³­±íÊı¾İ±êÊ¶+1
//				break;
			}
			y=p8rxbuff[26];//·µ»ØÊı¾İÓò³¤¶È
			MEMRead((u32)p8rxbuff,((u32)p8rxbuff)+26+1,y);
			
			d64b=MEMReadReg(((u32)p8rxbuff)+1,6);//·µ»ØµÄµØÖ·
			if(d64a!=d64b)
			{//±íµØÖ·²»ÏàÍ¬
				goto rxerr;
			}
			x=0;//ºÍĞ£Ñé¼ÆËã
			for(i=0;i<(p8rxbuff[9]+10);i++)
			{
				x+=p8rxbuff[i];
			}
			x&=0xff;
			if(x!=p8rxbuff[i])
			{//ºÍĞ£Ñé´í
				goto rxerr;
			}
			if((p8rxbuff[8]&0x40)!=0x0)
			{//´ÓÕ¾Òì³£»Ø´ğ,ÎŞ´ËÊı¾İÏî,Õı³£Ìø¹ı
				Terminal_Note->List[ListNo].ReCount=0;//³­±íÖØ·¢¼ÆÊı=0
				Terminal_Note->List[ListNo].DICount++;//³­±íÊı¾İ±êÊ¶+1
				break;
			}
			for(i=0;i<p8rxbuff[9];i++)
			{//Êı¾İÓò¼õ0x33
				p8rxbuff[10+i]-=0x33;
			}
			if(Protocol==1)
			{//DL/T645-1997
				x=p8RMLib[10+(3*Terminal_Note->List[ListNo].DICount)];
				x|=p8RMLib[10+(3*Terminal_Note->List[ListNo].DICount)+1]<<8;
				y=MEMReadReg(((u32)p8rxbuff)+10,2);
				if(x!=y)
				{//DI´íÎó
					goto rxerr;
				}
				i=p8RMLib[10+(3*Terminal_Note->List[ListNo].DICount)+2];
				if((i==0x0)||(p8rxbuff[9]==(i+2))||(p8rxbuff[9]==(i+2+1)))
				{//·µ»Ø³¤¶ÈÏàÍ¬
					UARTCtrl->MeterNo=Terminal_Note->List[ListNo].MeterNo;//¶ÔÓ¦µçÄÜ±íÅäÖÃĞòºÅ(°ë×Ö¶ÔÆë)(´Ó1¿ªÊ¼)
					UARTCtrl->FnCount=Terminal_Note->List[ListNo].FnCount;//³­±íFn¼ÆÊı
					UARTCtrl->RMCount=Terminal_Note->List[ListNo].DICount;//³­±íÊı¾İ±êÊ¶¼ÆÊı
					ReadMeter_DL645_1997_FnData(PORTn);//DL645_1997³­±í½ÓÊÕÊı¾İÌîÈëFnÊı¾İ»º³å
					Terminal_Note->List[ListNo].DICount=UARTCtrl->RMCount;//·µ»ØµÄ³­±íÊı¾İ±êÊ¶¼ÆÊı
					ReadMeterNote_OK(PORTn,Pn);//¼¯ÖĞ³­±íµç±í³­¶ÁĞÅÏ¢.³É¹¦
				}
				Terminal_Note->List[ListNo].ReCount=0;//³­±íÖØ·¢¼ÆÊı=0
				Terminal_Note->List[ListNo].DICount++;//³­±íÊı¾İ±êÊ¶+1
			}
			else
			{//DL/T645-2007
				x=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)];
				x|=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)+1]<<8;
				x|=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)+2]<<16;
				x|=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)+3]<<24;
				y=MEMReadReg(((u32)p8rxbuff)+10,4);
				if(x!=y)
				{//DI´íÎó
					goto rxerr;
				}
				i=p8RMLib[10+(5*Terminal_Note->List[ListNo].DICount)+4];
				if((i==0x0)||(p8rxbuff[9]==(i+4))||(p8rxbuff[9]==(i+4+1)))
				{//·µ»Ø³¤¶ÈÏàÍ¬
					UARTCtrl->MeterNo=Terminal_Note->List[ListNo].MeterNo;//¶ÔÓ¦µçÄÜ±íÅäÖÃĞòºÅ(°ë×Ö¶ÔÆë)(´Ó1¿ªÊ¼)
					UARTCtrl->FnCount=Terminal_Note->List[ListNo].FnCount;//³­±íFn¼ÆÊı
					UARTCtrl->RMCount=Terminal_Note->List[ListNo].DICount;//³­±íÊı¾İ±êÊ¶¼ÆÊı
					ReadMeter_DL645_2007_FnData(PORTn);//DL645_2007³­±í½ÓÊÕÊı¾İÌîÈëFnÊı¾İ»º³å
					Terminal_Note->List[ListNo].DICount=UARTCtrl->RMCount;//·µ»ØµÄ³­±íÊı¾İ±êÊ¶¼ÆÊı
					ReadMeterNote_OK(PORTn,Pn);//¼¯ÖĞ³­±íµç±í³­¶ÁĞÅÏ¢.³É¹¦
				}
				Terminal_Note->List[ListNo].ReCount=0;//³­±íÖØ·¢¼ÆÊı=0
				Terminal_Note->List[ListNo].DICount++;//³­±íÊı¾İ±êÊ¶+1
			}
			
			break;
	}
}

void KeyUserReadMeter_3762_CHINT(u32 PORTn)//ÔØ²¨Ä£¿é,ÖØµã»§³­±í
{
	u32 i;
	u32 x;
	u32 y;
	u32 Protocol;
	u32 Pn;
	u64 d64a;
	u64 d64b;
	
	u8 * p8rxbuff;
	u8 * p8txbuff;
	u8 * p8FnData;
	UARTCtrl_TypeDef * UARTCtrl;
	
	p8rxbuff=(u8 *)Get_ADDR_UARTnRx(PORTn);
	p8txbuff=(u8 *)Get_ADDR_UARTnTx(PORTn);
	//p8FnData=(u8 *)Get_ADDR_UARTnFnDataBuff(PORTn);
	p8FnData=(u8 *)ADDR_DATABUFF;
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	
	switch(Terminal_Router->RouterKeyUserTask)//ÖØµã»§³­¶ÁÈÎÎñ
	{
		case 0://ÔİÍ£Â·ÓÉ
			if(UARTCtrl->Task==0)
			{
				if(Terminal_Router->RouterStop==0)//ÔİÍ£Â·ÓÉ±êÊ¶:0=ÎŞ,1=³­ÖØµã»§,2=Êı¾İ×ª·¢,3=UART¶ÁÂ·ÓÉĞÅÏ¢,4=¹ã²¥Ğ£Ê±,5=¹ã²¥¶³½á,6=Í¨¶Ïµç¿ØÖÆ,7=...
				{
					Terminal_Router->RouterStop=1;//ÔİÍ£Â·ÓÉ±êÊ¶:0=ÎŞ,1=³­ÖØµã»§,2=Êı¾İ×ª·¢,3=UART¶ÁÂ·ÓÉĞÅÏ¢,4=¹ã²¥Ğ£Ê±,5=¹ã²¥¶³½á,6=Í¨¶Ïµç¿ØÖÆ,7=...
					Terminal_Router->RouterCtrl=2;//Â·ÓÉÆ÷¿ØÖÆÃüÁî0=¿Õ,1=ÖØÆô,2=ÔİÍ£,3=»Ö¸´,4=¼ì²â;Íê³Éºó×Ô¶¯»Øµ½0
				}
				Terminal_Router->RouterKeyUserTask++;//ÖØµã»§³­¶ÁÈÎÎñ
			}
			else
			{
				GeneralReadMeter_3762_CHINT(PORTn);//ÔØ²¨Ä£¿é,³£¹æ³­±í
			}
			break;
		case 1://AFN13 F1 Â·ÓÉÊı¾İ×ª·¢:¼à¿ØÔØ²¨´Ó½Úµã
			i=MEMReadReg(ADDR_AFN04F35,1);//Ì¨Çø¼¯ÖĞ³­±íÖØµã»§ÉèÖÃ
			if(i>MaxKeyUser)
			{
				i=MaxKeyUser;
			}
			if(UARTCtrl->KeyUserRMCount>=i)//ÖØµã»§³­¶ÁµçÄÜ±í¼ÆÊı
			{//È«²¿ÖØµã»§³­Íê
				UARTCtrl->KeyUserRMCount=0;//ÖØµã»§³­¶ÁµçÄÜ±í¼ÆÊı
				Terminal_Router->RouterKeyUserTask=0;//ÖØµã»§³­¶ÁÈÎÎñ
				UARTCtrl->KeyUserRMOKCountLast=UARTCtrl->KeyUserRMOKCount;//ÉÏ´ÎÖØµã»§³­¶Á³É¹¦¼ÆÊı
				UARTCtrl->KeyUserRMOKCount=0;//µ±Ç°ÖØµã»§³­¶Á³É¹¦¼ÆÊı
				if(Terminal_Router->RouterStop==1)//ÔİÍ£Â·ÓÉ±êÊ¶:0=ÎŞ,1=³­ÖØµã»§,2=Êı¾İ×ª·¢,3=UART¶ÁÂ·ÓÉĞÅÏ¢,4=¹ã²¥Ğ£Ê±,5=¹ã²¥¶³½á,6=Í¨¶Ïµç¿ØÖÆ,7=...
				{
					Terminal_Router->RouterCtrl=3;//Â·ÓÉÆ÷¿ØÖÆÃüÁî0=¿Õ,1=ÖØÆô,2=ÔİÍ£,3=»Ö¸´,4=¼ì²â;Íê³Éºó×Ô¶¯»Øµ½0
				}
				UARTCtrl->RMKeyUser=0;//³­¶ÁÖØµã»§±êÖ¾,0=³£¹æ³­¶Á,1=ÖØµã»§³­¶Á
				//Ğ¡Ê±¸üĞÂÔÚÖØµã»§³­ÍêºóÈôÓĞAFN04F10ÉèÖÃ±ä»¯Ôò³õÊ¼»¯Â·ÓÉÆ÷
				if(Terminal_Router->AFN04F10!=0)//AFN04F10ÉèÖÃ±ä»¯±êÖ¾0=Ã»,1=±ä»¯
				{
					Terminal_Router->AFN04F10=0;//AFN04F10ÉèÖÃ±ä»¯±êÖ¾0=Ã»,1=±ä»¯
					Terminal_Router->RouterInitTask=0;//Â·ÓÉÆ÷³­¶ÁÈÎÎñ0-99¹«¹²³õÊ¼»¯,100-199·Ö³§¼Ò³õÊ¼»¯,>=200Â·ÓÉ³­±í
				}
				return;
			}
			x=MEMReadReg(ADDR_AFN04F35+1+(2*UARTCtrl->KeyUserRMCount),2);//ÖØµã»§µÄµçÄÜ±í/½»Á÷²ÉÑù×°ÖÃĞòºÅ
			if((x==0)||(x>AFN04F10MaxPn))
			{//×°ÖÃĞòºÅ´í
				UARTCtrl->KeyUserRMCount++;//ÖØµã»§³­¶ÁµçÄÜ±í¼ÆÊı
				break;
			}
			x--;
			x=ADDR_AFN04F10+2+(LEN_AFN04F10_Pn*x);
			Pn=MEMReadReg(x,2);
			if((Pn==0)||(Pn>MaxRS485AddCarrierPn))
			{//²âÁ¿µãºÅ´í
				UARTCtrl->KeyUserRMCount++;//ÖØµã»§³­¶ÁµçÄÜ±í¼ÆÊı
				break;
			}
			i=MEMReadReg(x+2,1);
			i&=0x1f;
			if(i!=31)
			{//¶Ë¿Ú²»ÊÇÔØ²¨
				UARTCtrl->KeyUserRMCount++;//ÖØµã»§³­¶ÁµçÄÜ±í¼ÆÊı
				break;
			}
			i=MEMReadReg(x+3,1);//Í¨ĞÅĞ­ÒéÀàĞÍ BIN 1 
			Protocol=0;
			if(i==MEMReadReg(ADDR_Protocol_No+1,1))
			{//DL/T645-1997(1)
				Protocol=1;
			}
			if(i==MEMReadReg(ADDR_Protocol_No+2,1))
			{//DL/T645-2007(30)
				Protocol=2;
			}
			if(Protocol==0)
			{//Í¨ĞÅĞ­Òé²»Öª
				UARTCtrl->KeyUserRMCount++;//ÖØµã»§³­¶ÁµçÄÜ±í¼ÆÊı
				break;
			}

			p8txbuff[0]=0x68;
			p8txbuff[3]=0x41;//¿ØÖÆÂëÎª0x41
			p8txbuff[4]=4;//Í¨ĞÅÄ£¿é±êÊ¶=1
			p8txbuff[5]=0;
			p8txbuff[6]=0;
			p8txbuff[7]=0;
			p8txbuff[8]=0;
			p8txbuff[9]=0;
			MEMClr(0,((u32)p8txbuff)+10,6);
			MEMRead(((u32)p8txbuff)+10,ADDR_TERMINALADDR,2);;//Ö÷½ÚµãµØÖ·(Ô´µØÖ·)(Í¬ÖÕ¶ËµØÖ·)
			MEMRead(((u32)p8txbuff)+16,x+4,6);//´Ó½ÚµãµØÖ·(Ä¿µÄµØÖ·)
			p8txbuff[22]=0x13;//AFN=13H
			p8txbuff[23]=1;//Fn=1
			p8txbuff[24]=0;
			if(Protocol==1)
			{//dl645-1997
				p8txbuff[25]=1;//2;//×ª·¢Êı¾İ±êÊ¶ÀàĞÍ=0Í¸Ã÷´«Êä,1=DL645-1997,2=DL645-2007
				p8txbuff[26]=0;//¸½Êô½ÚµãÊı=0
				p8txbuff[27]=14;//DL645±¨ÎÄ³¤¶È
				p8txbuff[28]=0x68;
				MEMRead(((u32)p8txbuff)+29,x+4,6);//´Ó½ÚµãµØÖ·(Ä¿µÄµØÖ·)
				p8txbuff[35]=0x68;
				p8txbuff[36]=0x01;
				p8txbuff[37]=2;
				p8txbuff[38]=0x0f+0x33;//DI=0x901f
				p8txbuff[39]=0x90+0x33;
				p8txbuff[40]=0;
				p8txbuff[41]=0x16;
				for(i=0;i<12;i++)
				{
					p8txbuff[40]+=p8txbuff[28+i];
				}
			}
			else
			{//dl645-2007
				p8txbuff[25]=2;//2;//×ª·¢Êı¾İ±êÊ¶ÀàĞÍ=0Í¸Ã÷´«Êä,1=DL645-1997,2=DL645-2007
				p8txbuff[26]=0;//¸½Êô½ÚµãÊı=0
				p8txbuff[27]=16;//DL645±¨ÎÄ³¤¶È
				p8txbuff[28]=0x68;
				MEMRead(((u32)p8txbuff)+29,x+4,6);//´Ó½ÚµãµØÖ·(Ä¿µÄµØÖ·)
				p8txbuff[35]=0x68;
				p8txbuff[36]=0x11;
				p8txbuff[37]=4;
				p8txbuff[38]=0x00+0x33;//DI=0x0001FF00
				p8txbuff[39]=0x32;//0xff+0x33;
				p8txbuff[40]=0x01+0x33;
				p8txbuff[41]=0x00+0x33;
				p8txbuff[42]=0;
				p8txbuff[43]=0x16;
				for(i=0;i<14;i++)
				{
					p8txbuff[42]+=p8txbuff[28+i];
				}
			}
			i=28+p8txbuff[27]+2;//Ğè×Ü·¢ËÍ×Ö½ÚÊı
			p8txbuff[1]=i;
			p8txbuff[2]=i>>8;
			Uart_3762_CS((u32)p8txbuff);//ºÍĞ£Ñé¼ÆËã²¢Ğ´Èë(Í¬Ê±Ğ´Èë½áÊø0x16)ºÍ±È½Ï,·µ»Ø0=ÕıÈ·1=´íÎó,Èë¿Ú½ÓÊÕ»ò·¢ËÍ»º³å
			UARTCtrl->TxByte=i;//·¢ËÍ×Ö½ÚÊı(°ë×Ö¶ÔÆë)
			UARTCtrl->Task=3;
			UARTCtrl->RouterTimeOut=60000/10;//·¢ËÍºó½ÓÊÕ³¬Ê±¶¨Ê±Öµms/10(°ë×Ö¶ÔÆë)
			//ÏÔÊ¾³­±íµØÖ·
			CopyString((u8 *)"³­ÖØµã»§",(u8*)ADDR_DATABUFF);//¿½±´×Ö·û´®;·µ»Ø¿½±´×Ö·û´®×Ö½ÚÊı(²»¼Æ½áÊø0)
			for(i=0;i<6;i++)
			{
				x=p8txbuff[16+5-i];
				MEMWriteReg((x>>4)+0x30,ADDR_DATABUFF+8+(i*2),1);
				MEMWriteReg((x&0xf)+0x30,ADDR_DATABUFF+8+(i*2)+1,1);
			}
			MEMWriteReg(0,ADDR_DATABUFF+8+12,1);
			WarningOccur(PORTn,(u8 *)ADDR_DATABUFF);//¸æ¾¯·¢Éú,Èë¿Ú¸æ¾¯´úÂëºÍ¸æ¾¯×Ö·û´®
			Terminal_Router->RouterKeyUserTask++;//ÖØµã»§³­¶ÁÈÎÎñ
			break;
		case 2://½ÓÊÕ
			if(UARTCtrl->Task>=3)//0=¿ÕÏĞ,1=Íê³É1Ö¡·¢ÊÕ,2=½ÓÊÕ³¬Ê±(»ò´íÎó),3=Æô¶¯·¢ËÍ,4=ÕıÔÚ·¢ËÍ,5=ÕıÔÚ½ÓÊÕ
			{
				break;
			}
			x=MEMReadReg(ADDR_AFN04F35+1+(2*UARTCtrl->KeyUserRMCount),2);//ÖØµã»§µÄµçÄÜ±í/½»Á÷²ÉÑù×°ÖÃĞòºÅ
			if((x==0)||(x>AFN04F10MaxPn))
			{//×°ÖÃĞòºÅ´í
				goto rxerr;
			}
			x--;
			x=ADDR_AFN04F10+2+(LEN_AFN04F10_Pn*x);
			Pn=MEMReadReg(x,2);
			if((Pn==0)||(Pn>AFN0CF129KeyUserMaxPn))
			{//²âÁ¿µãºÅ´í
				goto rxerr;
			}
			i=MEMReadReg(x+3,1);//Í¨ĞÅĞ­ÒéÀàĞÍ BIN 1 
			Protocol=0;
			if(i==MEMReadReg(ADDR_Protocol_No+1,1))
			{//DL/T645-1997(1)
				Protocol=1;
			}
			if(i==MEMReadReg(ADDR_Protocol_No+2,1))
			{//DL/T645-2007(30)
				Protocol=2;
			}
			if(Protocol==0)
			{//Í¨ĞÅĞ­Òé²»Öª
				goto rxerr;
			}
			d64a=MEMReadReg(x+4,6);//È¡ÅäÖÃµÄÍ¨ĞÅµØÖ·
			MEMClr(0xee,(u32)p8FnData,Get_LEN_UARTnFnDataBuff(PORTn));
			MEMRead(((u32)p8FnData)+1,ADDR_YMDHMS+1,5);//³­±íÊ±¼ä
			
			i=p8rxbuff[1]+(p8rxbuff[2]<<8);
			if(i<=16)
			{//·ñÈÏ»Ø´ğ
		rxerr:
				UARTCtrl->Task=0;//¿ÕÏĞ1´Î
				UARTCtrl->KeyUserRMCount++;//ÖØµã»§³­¶ÁµçÄÜ±í¼ÆÊı
				Terminal_Router->RouterKeyUserTask--;//ÖØµã»§³­¶ÁÈÎÎñ
				break;
			}
			y=p8rxbuff[26];//·µ»ØÊı¾İÓò³¤¶È
			if(UARTCtrl->Task!=1)
			{
				y=0;//½ÓÊÕÊı¾İ³¤¶È
			}
			else
			{
				i=MEMReadReg(((u32)p8rxbuff)+22,3);
				if(i!=0x113)
				{//AFN=13H,Fn=1
					y=0;//½ÓÊÕÊı¾İ³¤¶È
				}
			}
			if(y==0)
			{//½ÓÊÕÊı¾İ³¤¶È=0
				goto rxerr;
			}
			MEMRead((u32)p8rxbuff,((u32)p8rxbuff)+26+1,y);
			
			d64b=MEMReadReg(((u32)p8rxbuff)+1,6);//·µ»ØµÄµØÖ·
			if(d64a!=d64b)
			{//±íµØÖ·²»ÏàÍ¬
				goto rxerr;
			}
			x=0;//ºÍĞ£Ñé¼ÆËã
			for(i=0;i<(p8rxbuff[9]+10);i++)
			{
				x+=p8rxbuff[i];
			}
			x&=0xff;
			if(x!=p8rxbuff[i])
			{//ºÍĞ£Ñé´í
				goto rxerr;
			}
			if((p8rxbuff[8]&0x40)!=0x0)
			{//¿ØÖÆÂë´ÓÕ¾»Ø´ğÒì³£
				goto rxerr;
			}
			for(i=0;i<p8rxbuff[9];i++)
			{//Êı¾İÓò¼õ0x33
				p8rxbuff[10+i]-=0x33;
			}
			if(Protocol==1)
			{//1997
				if(p8rxbuff[9]<=2)
				{//ÎŞÊı¾İ
					goto rxerr;
				}
				i=MEMReadReg(((u32)p8rxbuff)+10,2);
				if(i!=0x901f)
				{
					goto rxerr;
				}
			}
			else
			{//2007
				if(p8rxbuff[9]<=4)
				{//ÎŞÊı¾İ
					goto rxerr;
				}
				i=MEMReadReg(((u32)p8rxbuff)+10,4);
				if(i!=0x0001FF00)
				{
					goto rxerr;
				}
			}
			for(i=0;i<p8rxbuff[9];i++)
			{
				if(p8rxbuff[10+i]==0xff)
				{
					p8rxbuff[10+i]=0;//µ¥Ïà±í¿éÎŞĞ§Êı¾İÌî0xff
				}
			}
			if(Protocol==1)
			{//1997
				i=p8rxbuff[9];
				if(i>=6)
				{
					i-=6;
					i/=4;
					if(i>MaxTariff)
					{
						i=MaxTariff;
					}
					p8FnData[6]=i;
					i+=1;
					p8FnData+=7;
					p8rxbuff+=12;
					for(;i!=0x0;i--)
					{
						p8FnData[0]=0;
						p8FnData[1]=p8rxbuff[0];
						p8FnData[2]=p8rxbuff[1];
						p8FnData[3]=p8rxbuff[2];
						p8FnData[4]=p8rxbuff[3];
						p8FnData+=5;
						p8rxbuff+=4;
					}
				}
			}
			else
			{//2007
				i=p8rxbuff[9];
				if(i>=8)
				{
					i-=8;
					i/=4;
					if(i>MaxTariff)
					{
						i=MaxTariff;
					}
					p8FnData[6]=i;
					i+=1;
					p8FnData+=7;
					p8rxbuff+=14;
					for(;i!=0x0;i--)
					{
						p8FnData[0]=0;
						p8FnData[1]=p8rxbuff[0];
						p8FnData[2]=p8rxbuff[1];
						p8FnData[3]=p8rxbuff[2];
						p8FnData[4]=p8rxbuff[3];
						p8FnData+=5;
						p8rxbuff+=4;
					}
				}
			}
			//SaveClass1Data(129,Pn,((u32)p8FnData)+1);//´æÖüÀà1Êı¾İ
			MEMWrite(((u32)p8FnData)+1,ADDR_AFN0CF129_KeyUser+((6+(5*(1+MaxTariff)))*(Pn-1)),6+(5*(1+MaxTariff)));
			
			UARTCtrl->Task=0;//¿ÕÏĞ1´Î
			UARTCtrl->KeyUserRMOKCount++;//µ±Ç°ÖØµã»§³­¶Á³É¹¦¼ÆÊı
			UARTCtrl->KeyUserRMCount++;//ÖØµã»§³­¶ÁµçÄÜ±í¼ÆÊı
			Terminal_Router->RouterKeyUserTask--;//ÖØµã»§³­¶ÁÈÎÎñ
			break;
		default:
			Terminal_Router->RouterKeyUserTask=0;//ÖØµã»§³­¶Á³õÊ¼»¯ÈÎÎñ
			break;
	}	
}


void UpData_CHINT(u32 PORTn)//Â·ÓÉÈí¼ş¸üĞÂ
{

}


#endif


//0x68
//×Ü³¤¶ÈL
//×Ü³¤¶ÈL
//¿ØÖÆÂë
//ĞÅÏ¢ÓòR-1
//ĞÅÏ¢ÓòR-2
//ĞÅÏ¢ÓòR-3
//ĞÅÏ¢ÓòR-4
//ĞÅÏ¢ÓòR-5
//ĞÅÏ¢ÓòR-6
//µØÖ·ÓòA1,A2,A3
//Ó¦ÓÃ¹¦ÄÜÂëAFN
//Êı¾İµ¥Ôª±êÊ¶DT1
//Êı¾İµ¥Ôª±êÊ¶DT2
//Êı¾İµ¥Ôª
//CS
//0x16
